---
type: DirectShapeTypeOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# DirectShapeTypeOptions

`Autodesk.Revit.DB.DirectShapeTypeOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DirectShapeTypeOptions | 2021 | `public DirectShapeTypeOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqualTo | 2021 | `public bool IsEqualTo ( DirectShapeTypeOptions other )` |
| Method | IsValid | 2021 | `public bool IsValid ()` |
| Property | AllowDuplicateNames | 2021 | `public bool AllowDuplicateNames { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |